function n(n, t) {
    return {
        message: n,
        type: t
    };
}

function t(t) {
    return n(t, "IC");
}

function r(t) {
    return n(t, "ID");
}

function e(t) {
    return n(t, "设备");
}

var X = {
    0: t("卡片操作成功"),
    1: t("未检测到卡片"),
    2: t("卡片移开过快"),
    3: t("卡片不是标准14A，CRC校验异常"),
    4: t("检测到卡片冲突，一次只可以操作一张卡哦"),
    5: t("卡片BCC错误且无法自动修复，此卡已损坏"),
    6: t("卡片验证密钥错误"),
    32: t("新型全加密卡"),
    33: t("对非全加密卡进行了全加密计算"),
    34: t("新型全加密卡"),
    35: t("计算全加密卡时中断了，或更换了卡片，请重试"),
    36: t("静态应答NT的卡片"),
    37: t("无法预测NT的卡片"),
    38: t("半加密计算次数达到上限，请调整卡片位置后重试，多次无果则不支持此卡"),
    39: t("全加密计算次数达到上限，请调整卡片位置后重试，多次无果则不支持此卡"),
    40: t("GEN1A（UID）卡片读取时移开过快或是位置距离天线太偏"),
    41: t("新型全加密卡，尝试使用变色龙等设备在门上刷卡，辅助完读卡步骤。"),
    42: t("卡片不是空白卡，无法二次写入，请先清空卡片再写入"),
    43: t("GEN1A（UID）卡片写入时移开过快或是位置距离天线太偏"),
    44: t("可极速计算的ST卡"),
    45: t("该卡片可能有扇区损坏"),
    46: t("该卡片写入UID号失败。如果是写手环或手机，则忽略此提示，写入是成功的。"),
    47: t("无法连接到计算服务器，请检查网络"),
    48: t("内部计算机资源不足或不支持计算此卡片"),
    49: t("该卡片所需算力太高，暂不支持此卡"),
    50: t("半加密Hard卡，本设备暂不支持，可联系客服寄回代复制"),
    64: r("卡片操作成功"),
    65: r("未检测到卡片"),
    66: r("T55XX写入失败"),
    67: r("82XX写入失败"),
    68: r("卡号已经相同，如是重复写卡，可以忽略此提示"),
    69: r("未检测到卡片"),
    70: r("无法搜索到ZX82XX卡片"),
    71: r("对ZX82XX标签选卡失败"),
    72: r("对ZX82XX标签验证失败"),
    73: r("对ZX82XX标签写卡失败"),
    96: e("通信参数异常，请联系客服处理"),
    97: e("蓝牙通信异常，可能是电磁干扰较强，请更换电源环境重试"),
    98: e("空白卡片的类型不正确，请按照提示使用正确的型号"),
    99: e("空白卡片的容量不正确，非常规卡，请联系客服购买"),
    100: e("不支持的指令，请更新固件"),
    101: e("保存数据到复卡机设备时发生了错误"),
    102: e("保存数据到复卡机设备成功"),
    103: e("设备的出厂信息获取失败"),
    104: e("发现盗版设备，我司将对此行为依法追究到底"),
    105: e("本设备暂时不支持读取此卡片"),
    106: e("本设备暂时不支持写入此卡片"),
    107: e("蓝牙连接断开，请勿离复卡机太远，并且避免处于强电磁干扰环境"),
    108: e("蓝牙通信超时，请勿离复卡机太远，并且避免处于强电磁干扰环境")
};

module.exports = {
    getMsg: function(n) {
        if (n in X) {
            var t = X[n];
            return "".concat(t.message, "（").concat(t.type, "）");
        }
        return "暂无";
    }
};